# DataStorage Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DataStorage Class
Members See Also
---
An element which allows an API applications to organize and store data.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class DataStorage : Element
```

Visual Basic
---
```text
Public Class DataStorage _
	Inherits Element
```

Visual C++
---
```text
public ref class DataStorage : public Element
```

# Remarks
Applications can create instances of these elements to logically organize different sets of ExtensibleStorage entities into separate elements. This allows an application to update one set of data in a local workshared project without locking other elements.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.ExtensibleStorage..::..DataStorage
# See Also
DataStorage Members
Autodesk.Revit.DB.ExtensibleStorage Namespace